Table of Contents
 Class LoadOnLine
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Load on line
[OpenModelClass("CI.StructModel.Loading.LoadOnLine,CI.Loading", "CI.StructModel.Loading.ILoadOnLine,CI.BasicTypes")]
public class LoadOnLine : OpenElementId
Inheritance
object
OpenObject
OpenElementId
LoadOnLine
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Examples
This sample shows how to create a load on the line.
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Load case
LoadCase loadCase = new LoadCase();
//...
openModel.AddObject(loadCase);
//Uniform load on line2 - relative between 0.1-0.6. In the LCS of line. -2kN in the z-direction
LoadOnLine loadLine = new LoadOnLine();
loadLine.Bimp = new LoadImpulse() { Z = -2e3 };
loadLine.Eimp = new LoadImpulse() { Z = -2e3 };
loadLine.Type = LoadType.LoadForce;
loadLine.Direction = LoadDirection.InLcs;
loadLine.Geometry = new ReferenceElement(line2);
loadLine.LoadProjection = LoadProjection.Length;
loadLine.RelativeBeginPosition = 0.1;
loadLine.RelativeBeginPosition = 0.6;
openModel.AddObject(loadLine);
loadCase.LoadsOnLine.Add(new ReferenceElement(loadLine));
Constructors
 LoadOnLine()
Constructor
public LoadOnLine()
Properties
 Bimp
Impulse at the begin
public LoadImpulse Bimp { get; set; }
Property Value
LoadImpulse
 Direction
1=global, 0=local
public LoadDirection Direction { get; set; }
Property Value
LoadDirection
 Eimp
Impulse at the end
public LoadImpulse Eimp { get; set; }
Property Value
LoadImpulse
 ExY
Eccentricity local Y on the beginning
public double ExY { get; set; }
Property Value
double
 ExYEnd
Eccentricity local Y at the end
public double ExYEnd { get; set; }
Property Value
double
 ExZ
Eccentricity local Z on the beginning
public double ExZ { get; set; }
Property Value
double
 ExZEnd
Eccentricity local Z at the end
public double ExZEnd { get; set; }
Property Value
double
 Geometry
Segment3D or PolyLine3D
public ReferenceElement Geometry { get; set; }
Property Value
ReferenceElement
 LoadProjection
Gets, sets load projection
public LoadProjection LoadProjection { get; set; }
Property Value
LoadProjection
 RelativeBeginPosition
Begin position on Segment3D
public double RelativeBeginPosition { get; set; }
Property Value
double
 RelativeEndPosition
End position on Segment3D
public double RelativeEndPosition { get; set; }
Property Value
double
 Type
Type of load
public LoadType Type { get; set; }
Property Value
LoadType
 Edit this page